; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph6 - mode
	image5 - mode
	spectrograph0 - mode
	spectrograph4 - mode
	image3 - mode
	spectrograph2 - mode
	thermograph1 - mode
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Star6 - direction
	Star7 - direction
	GroundStation1 - direction
	Star0 - direction
	Star2 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 Star7)
	(supports instrument1 spectrograph4)
	(supports instrument1 thermograph1)
	(supports instrument1 image5)
	(supports instrument1 spectrograph0)
	(supports instrument1 thermograph6)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star11)
)
(:goal (and
	(have_image Star8 image5)
	(have_image Phenomenon9 image3)
	(have_image Star10 spectrograph0)
	(have_image Star10 thermograph6)
	(have_image Star11 image5)
	(have_image Star11 image3)
	(have_image Phenomenon12 image3)
	(have_image Phenomenon12 spectrograph0)
	(have_image Star13 thermograph6)
	(have_image Phenomenon14 spectrograph0)
))

)

; plan
1. (turn_to satellite0 groundstation1 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 10
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 10
3. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 10
4. (turn_to satellite0 star11 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star11)
   goals met: 0 of 10
5. (take_image satellite0 star11 instrument0 image3)
   added: (have_image star11 image3)
   goals met: 1 of 10
6. (turn_to satellite0 phenomenon9 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 phenomenon9)
   goals met: 1 of 10
7. (take_image satellite0 phenomenon9 instrument0 image3)
   added: (have_image phenomenon9 image3)
   goals met: 2 of 10
8. (turn_to satellite0 phenomenon12 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 10
9. (take_image satellite0 phenomenon12 instrument0 image3)
   added: (have_image phenomenon12 image3)
   goals met: 3 of 10
10. (turn_to satellite0 star0 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star0)
   goals met: 3 of 10
11. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 3 of 10
12. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 10
13. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 3 of 10
14. (turn_to satellite0 phenomenon12 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 10
15. (take_image satellite0 phenomenon12 instrument1 spectrograph0)
   added: (have_image phenomenon12 spectrograph0)
   goals met: 4 of 10
16. (turn_to satellite0 phenomenon14 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon14)
   goals met: 4 of 10
17. (take_image satellite0 phenomenon14 instrument1 spectrograph0)
   added: (have_image phenomenon14 spectrograph0)
   goals met: 5 of 10
18. (turn_to satellite0 star10 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 star10)
   goals met: 5 of 10
19. (take_image satellite0 star10 instrument1 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 6 of 10
20. (take_image satellite0 star10 instrument1 thermograph6)
   added: (have_image star10 thermograph6)
   goals met: 7 of 10
21. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 7 of 10
22. (take_image satellite0 star11 instrument1 image5)
   added: (have_image star11 image5)
   goals met: 8 of 10
23. (turn_to satellite0 star13 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star13)
   goals met: 8 of 10
24. (take_image satellite0 star13 instrument1 thermograph6)
   added: (have_image star13 thermograph6)
   goals met: 9 of 10
25. (turn_to satellite0 star8 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star8)
   goals met: 9 of 10
26. (take_image satellite0 star8 instrument1 image5)
   added: (have_image star8 image5)
   goals met: 10 of 10
